ezois_ka/oooezoiskaobmen/src/Reports/КонтролируемыеСделкиДляВключенияВУведомление/КонтролируемыеСделкиДляВключенияВУведомление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КонтролируемыеСделкиДляВключенияВУведомление</name>
  <attributes>
    <name>Уведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеДополнительныхПолей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРасшифровки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Группировка</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипГруппировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/ДоговорыУчастниковКонтролируемыхСделок/ДоговорыУчастниковКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорыУчастниковКонтролируемыхСделок</name>
  <resources>
    <name>КодНаименованияСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияЦеныСделки</name>
    <type>
      <types>CatalogRef.СпособыОпределенияЦенКонтролируемыхСделок</types>
    </type>
  </resources>
  <resources>
    <name>КодУсловийПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СделкаОблагаетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтороныПрименяютРазныеСтавкиПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СделкаОтноситсяКДеятельностиНовогоМорскогоМесторождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СделкаОтноситсяКДеятельностиОблагаемойНалогомНаДопДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СделкаНеЯвляетсяКонтролируемойПоП4</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/УведомлениеОКонтролируемыхСделках/УведомлениеОКонтролируемыхСделках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОКонтролируемыхСделках</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.КонтролируемыеСделкиОрганизаций</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияСпискаСделок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаполненияУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМестаПредставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппироватьСделкиСОдинаковойЦеной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФормыРеорганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННРеорганизованнойОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КППРеорганизованнойОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Reports/КонтролируемыеСделкиДляВключенияВУведомление/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует параметры исполнения отчета.
//
// Возвращаемое значение:
//  Структура - параметры структуры:
//  * ИспользоватьПередКомпоновкойМакета - Булево - Истана, если использовать обработку перед компоновкой макета.
//  * ИспользоватьПослеВыводаРезультата - Булево - Истина, если использовать обработку после вывода результата.
//  * ИспользоватьДанныеРасшифровки - Булево - Истана, если использовать данные расшифровки.
//  * ИспользоватьВнешниеНаборыДанных - Булево - Истина, использовать внешние наборы данных.
//  * ИспользоватьПривилегированныйРежим - Булево - Истина, если выполнять в привилегированном режиме.
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Результат.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
	Результат.Вставить("ИспользоватьДанныеРасшифровки",      Истина);
	Результат.Вставить("ИспользоватьВнешниеНаборыДанных",    Истина);
	Результат.Вставить("ИспользоватьПривилегированныйРежим", Истина);
	
	Возврат Результат;
													
КонецФункции

// Функция возвращает параметры отчета, см. БухгалтерскиеОтчетыВызовСервера.СформироватьОтчет
//
// Параметры:
//  ПараметрыОтчета - Структура - параметры отчета:
//  * ВключатьОбособленныеПодразделения - Булево - Истина, если включать в отчет информацию по 
//                                                 обособленным подразделениям.
//  * ВыводитьЗаголовок                 - Булево - Истина, если выводить заголовок отчета.
//  * ВыводитьПодвал                    - Булево - Истина, если выводить подвал отчета.
//  * Группировка                       - ТаблицаЗначений - параметры группировки отчета.
//  * ДанныеРасшифровки                 - Строка - адрес хранилища расшифровки отчета.
//  * ДополнительныеПоля                - ТаблицаЗначений - параметры дополнительных полей отчета.
//  * ИдентификаторОтчета               - Строка - наименование идентификатора отчета.
//  * КонецПериода                      - Дата - конец периода отчета.
//  * МакетОформления                   - Строка - наименование макет оформления отчета.
//  * НастройкиКомпоновкиДанных         - НастройкиКомпоновкиДанных - насткойки компоновки данных отчета.
//  * НачалоПериода                     - Дата - начало периода отчета.
//  * Организация                       - СправочникСсылка.Организации - организация, по которой формируется отчет. 
//  * ОтчетныйГод                       - Число - числовое значение года отчетного периода.
//  * РазмещениеДополнительныхПолей     - Число - число дополнтельных полей.
//  * РежимРасшифровки                  - Булево - Истина, если режим расшифровки.
//  * СхемаКомпоновкиДанных             - СхемаКомпоновкиДанных - схема отчета.
//  * Уведомление                       - ДокументСсылка.УведомлениеОКонтролируемыхСделках - ссылка на уведомление, по
//                                                                                           которому формируется отчет.
//  МакетКомпоновки - МакетКомпоновкиДанных - сформированный макет компоновки данных.
//
// Возвращаемое значение:
//	Структура - структура с ключем:
//  * КонтролируемыеСделки - ТаблицаЗначений - данные о контрлируемых сделках:
//
Функция ПолучитьВнешниеНаборыДанных(ПараметрыОтчета, МакетКомпоновки) Экспорт
	
	СписокДоступныхОрганизаций = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	Если ЗначениеЗаполнено(ПараметрыОтчета.Организация) И СписокДоступныхОрганизаций.Найти(ПараметрыОтчета.Организация) = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Нет доступа к данным по организации для получения внешнего набора данных'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВерсияУведомления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Уведомление, "ВерсияУведомления");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Документы.УведомлениеОКонтролируемыхСделках.ПолучитьВременныеТаблицыДляЗаполненияУведомления(ПараметрыОтчета.Уведомление);
	
	Если ВерсияУведомления >= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2019() Тогда
		Запрос.Текст = ТекстЗапросаКонтролируемыхСделок2019();
	Иначе
		Запрос.Текст = ТекстЗапросаКонтролируемыхСделок2012();
	КонецЕсли;
	
	СделкиУведомления = Запрос.Выполнить().Выгрузить();
	
	ДополнитьТаблицуПричинамиВключенияВУведомление(СделкиУведомления, ВерсияУведомления);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("КонтролируемыеСделки", СделкиУведомления);
	
	Возврат ВнешниеНаборыДанных;	
КонецФункции

// Функция возвращает заголовок отчета, см. БухгалтерскиеОтчетыВызовСервера.ВывестиЗаголовокОтчета
// 
// Параметры:
//  ПараметрыОтчета - Структура - параметры отчета.
//  ОрганизацияВНачале - Булево - Истина, если выводит инофрмацию об организаци в начале.
//
// Возвращаемое значение:
//	Строка - залоголовк отчета.
//
Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт 
	
	Возврат НСтр("ru = 'Контролируемые сделки для включения в уведомление'");
	
КонецФункции

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПередКомпоновкойМакета.
// В процедуре можно доработать компоновщик перед выводом в отчет.
// Изменения сохранены не будут.
//
// Параметры:
//  ПараметрыОтчета      - Структура - параметры структуры:
//  * СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - схема компоновки данных отчета.
//  * Группировка           - ТаблицаЗначений - параметры полей группировки отчета.
//  Схема                   - СхемаКомпоновкиДанных - схема отчета.
//  КомпоновщикНастроек     - КомпоновщикНастроекКомпоновкиДанных - описание связи настроек и схемы отчета.
//
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	ПредопределенныеНастройки = ПараметрыОтчета.СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки;
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
		
	Таблица = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
		
	КолонкаСумма = Таблица.Колонки.Добавить();
	КолонкаСумма.Имя           = "Сумма";
	КолонкаСумма.Использование = Истина;
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КолонкаСумма.Выбор, "СуммаБезНДСВРублях");			
	
	Структура =  Новый Структура("Структура",Таблица.Строки);	
	
	КоличествоГруппировок = 0;
	Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл 
		Если ПолеВыбраннойГруппировки.Использование Тогда
			Структура = Структура.Структура.Добавить();
			
			ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование  = Истина;
			ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных(ПолеВыбраннойГруппировки.Поле);
			
			Если ПолеВыбраннойГруппировки.ТипГруппировки = 1 Тогда
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
			ИначеЕсли ПолеВыбраннойГруппировки.ТипГруппировки = 2 Тогда
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
			Иначе
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
			КонецЕсли;
			
			Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
						
			КоличествоГруппировок = КоличествоГруппировок + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Добавляем предопределенные недоступные группировки (всегда в конце)
	
	ПредопределеннаяГруппировка = ПредопределенныеНастройки.Структура[0].Строки;
	Пока ПредопределеннаяГруппировка.Количество() > 0 Цикл
		
		Если ПредопределеннаяГруппировка[0].ПоляГруппировки.Элементы.Количество() > 0 Тогда
			
			Если ПредопределеннаяГруппировка[0].РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный И ПредопределеннаяГруппировка[0].Состояние = СостояниеЭлементаНастройкиКомпоновкиДанных.Включен Тогда
				Структура = Структура.Структура.Добавить();
				
				// Поля группировок
				Для Каждого ПолеПредопределеннойГруппировки Из ПредопределеннаяГруппировка[0].ПоляГруппировки.Элементы Цикл
					Если ТипЗнч(ПолеПредопределеннойГруппировки) = Тип("АвтоПолеГруппировкиКомпоновкиДанных") Тогда
						ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("АвтоПолеГруппировкиКомпоновкиДанных"));
					Иначе
						Если НайтиГруппировку(Таблица.Строки, ПолеПредопределеннойГруппировки.Поле) = Неопределено Тогда
							ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
							ЗаполнитьЗначенияСвойств(ПолеГруппировки,ПолеПредопределеннойГруппировки);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;	
				
				//Отборы
				Для Каждого ОтборПредопределеннойГруппировки Из ПредопределеннаяГруппировка[0].Отбор.Элементы Цикл
					ОтборГруппировки =  Структура.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЗаполнитьЗначенияСвойств(ОтборГруппировки,ОтборПредопределеннойГруппировки);
				КонецЦикла;	
				
				// Условное оформление
				Для Каждого УсловноеОформлениеПредопределеннойГруппировки Из ПредопределеннаяГруппировка[0].УсловноеОформление.Элементы Цикл
					УсловноеОформлениеГруппировки =  Структура.УсловноеОформление.Элементы.Добавить();
					ЗаполнитьЗначенияСвойств(УсловноеОформлениеГруппировки,УсловноеОформлениеПредопределеннойГруппировки);
					
					//Отбор
					Для Каждого ОтборПредопределенногоОформления Из УсловноеОформлениеПредопределеннойГруппировки.Отбор.Элементы Цикл
						ОтборОформления =  УсловноеОформлениеГруппировки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
						ЗаполнитьЗначенияСвойств(ОтборОформления,ОтборПредопределенногоОформления);
					КонецЦикла;	
					
					// Параметры оформления
					Для ИндексПараметра = 0 По УсловноеОформлениеПредопределеннойГруппировки.Оформление.Элементы.Количество() - 1 Цикл
						ОформлениеПредопределеннаяГруппировка = УсловноеОформлениеПредопределеннойГруппировки.Оформление.Элементы[ИндексПараметра];
						ОформлениеГруппировки =  УсловноеОформлениеГруппировки.Оформление.Элементы[ИндексПараметра];
						ЗаполнитьЗначенияСвойств(ОформлениеГруппировки,ОформлениеПредопределеннаяГруппировка);
					КонецЦикла;	
					
					Для Каждого ПредопределенноеОформляемоеПолеГруппировки Из УсловноеОформлениеПредопределеннойГруппировки.Поля.Элементы Цикл
						ОформляемоеПоле = УсловноеОформлениеГруппировки.Поля.Элементы.Добавить();
						ЗаполнитьЗначенияСвойств(ОформляемоеПоле,ПредопределенноеОформляемоеПолеГруппировки);
					КонецЦикла;	
					
				КонецЦикла;	
				
				//Выбор
				Для Каждого ВыборПредопределеннойГруппировки Из ПредопределеннаяГруппировка[0].Выбор.Элементы Цикл
					Если ТипЗнч(ВыборПредопределеннойГруппировки) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
						Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));	
					Иначе
						Если НайтиГруппировку(Таблица.Строки, ВыборПредопределеннойГруппировки.Поле) = Неопределено Тогда
							ДобавитьВыбранноеПолеИлиГруппу(ВыборПредопределеннойГруппировки,Структура.Выбор);	
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;	
				
				//Порядок
				Для Каждого ПорядокПредопределеннойГруппировки Из ПредопределеннаяГруппировка[0].Порядок.Элементы Цикл
					Если ТипЗнч(ПорядокПредопределеннойГруппировки) = Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
						Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));	
					Иначе	
						ПорядокГруппировки =  Структура.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
						ЗаполнитьЗначенияСвойств(ПорядокГруппировки,ПорядокПредопределеннойГруппировки);
					КонецЕсли;
				КонецЦикла;	
				
				// Параметры вывода
				Для ИндексПараметра = 0 По ПредопределеннаяГруппировка[0].ПараметрыВывода.Элементы.Количество() - 1 Цикл
					ПараметрыВыводаПредопределеннаяГруппировка = ПредопределеннаяГруппировка[0].ПараметрыВывода.Элементы[ИндексПараметра];
					ПараметрыВыводаГруппировки =  Структура.ПараметрыВывода.Элементы[ИндексПараметра];
					ЗаполнитьЗначенияСвойств(ПараметрыВыводаГруппировки,ПараметрыВыводаПредопределеннаяГруппировка);
				КонецЦикла;	
				
			КонецЕсли;
		КонецЕсли;
		
		ПредопределеннаяГруппировка = ПредопределеннаяГруппировка[0].Структура;
		
	КонецЦикла;
	
	// Дополнительные данные
	БухгалтерскиеОтчетыВызовСервера.ДобавитьДополнительныеПоля(ПараметрыОтчета, КомпоновщикНастроек);
					
КонецПроцедуры

// Процедура выполняет обработку результата отчета, см. БухгалтерскиеОтчетыВызовСервера.СформироватьОтчет.
//
// Параметры:
//  ПараметрыОтчета - Структура - параметры отчета:
//  * ВключатьОбособленныеПодразделения - Булево - Истина, если включать в отчет информацию по 
//                                                 обособленным подразделениям.
//  * ВыводитьЗаголовок                 - Булево - Истина, если выводить заголовок отчета.
//  * ВыводитьПодвал                    - Булево - Истина, если выводить подвал отчета.
//  * Группировка                       - ТаблицаЗначений - параметры группировки отчета.
//  * ДанныеРасшифровки                 - Строка - адрес хранилища расшифровки отчета.
//  * ДополнительныеПоля                - ТаблицаЗначений - параметры дополнительных полей отчета.
//  * ИдентификаторОтчета               - Строка - наименование идентификатора отчета.
//  * КонецПериода                      - Дата - конец периода отчета.
//  * МакетОформления                   - Строка - наименование макет оформления отчета.
//  * НастройкиКомпоновкиДанных         - НастройкиКомпоновкиДанных - насткойки компоновки данных отчета.
//  * НачалоПериода                     - Дата - начало периода отчета.
//  * Организация                       - СправочникСсылка.Организации - организация, по которой формируется отчет. 
//  * ОтчетныйГод                       - Число - числовое значение года отчетного периода.
//  * РазмещениеДополнительныхПолей     - Число - число дополнтельных полей.
//  * РежимРасшифровки                  - Булево - Истина, если режим расшифровки.
//  * СхемаКомпоновкиДанных             - СхемаКомпоновкиДанных - схема отчета.
//  * Уведомление                       - ДокументСсылка.УведомлениеОКонтролируемыхСделках - ссылка на уведомление, по
//                                                                                           которому формируется отчет.
//  Результат                           - ТабличныйДокумент - табличный документ, в который выводится резельтат 
//                                                            формирования отчета.
//
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
	Если Результат.Области.Найти("Заголовок") = Неопределено Тогда
		Результат.ФиксацияСверху = 0;
	Иначе
		Результат.ФиксацияСверху = Результат.Области.Заголовок.Низ;
	КонецЕсли;
	Результат.ФиксацияСлева = 0;
	
КонецПроцедуры

// Функция возвращает показатели отчета, см. БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполнения
// Возвращаемое значение:
//	Массив из Строка- массив значений строкового типа.
//
Функция ПолучитьНаборПоказателей() Экспорт
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("БУ");
	НаборПоказателей.Добавить("НУ");
	НаборПоказателей.Добавить("ПР");
	НаборПоказателей.Добавить("ВР");
	
	Возврат НаборПоказателей;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает группировку таблицы компоновки данных.
//
// Параметры:
//  Структура - КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных - элементы структуры таблицы компоновки данных.
//  Имя       - Строка - имя поля компоновки данных.
//
// Возвращаемое значение:
// ГруппировкаТаблицыКомпоновкиДанных - значение группировки таблицы компоновки данных.
//
Функция НайтиГруппировку(Структура, Имя)
	
	Для каждого Элемент Из Структура Цикл
		
		Для каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
			Если Не ТипЗнч(Поле) = Тип("АвтоПолеГруппировкиКомпоновкиДанных") Тогда
				Если Поле.Поле = Новый ПолеКомпоновкиДанных(Имя) Тогда
					Возврат Элемент;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Элемент.Структура.Количество() = 0 Тогда
			Возврат Неопределено;
		Иначе
			Группировка = НайтиГруппировку(Элемент.Структура, Имя);
		КонецЕсли;
	КонецЦикла;
	Возврат Группировка;
	
КонецФункции

Процедура ДобавитьВыбранноеПолеИлиГруппу(Поле,Выбор)
	
	Если ТипЗнч(Поле) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
		ВыборГруппировки =  Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(ВыборГруппировки,Поле);
	ИначеЕсли ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
		ВыборГруппировки =  Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(ВыборГруппировки,Поле);
		Для Каждого ПолеГруппы Из Поле.Элементы  Цикл
			ДобавитьВыбранноеПолеИлиГруппу(ПолеГруппы,ВыборГруппировки);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаКонтролируемыхСделок2012()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КонтролируемыеСделки.Организация КАК Организация,
	|	КонтролируемыеСделки.ОтчетныйГод КАК ОтчетныйГод,
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК Контрагент,
	|	КонтролируемыеСделки.Контрагент КАК ОбособленноеПодразделениеКонтрагента,
	|	КонтролируемыеСделки.Договор КАК Договор,
	|	КонтролируемыеСделки.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли КАК СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ КАК КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	КонтролируемыеСделки.СделкаОблагаетсяЕНВД КАК СделкаОблагаетсяЕНВД,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРазнымСтавкамНалогаНаПрибыль КАК СделкаКонтролируетсяПоРазнымСтавкамНалогаНаПрибыль,
	|	КонтролируемыеСделки.СделкаСПлательщикомЕСХН КАК СделкаСПлательщикомЕСХН,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль КАК СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ КАК СделкаКонтролируетсяПоНДПИ,
	|	КонтролируемыеСделки.СделкаМорскогоМесторождения КАК СделкаМорскогоМесторождения,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам КАК СделкаКонтролируетсяПоИнвестиционнымПроектам,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС КАК СделкаКонтролируетсяПоОсвобождениюНДС,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету КАК СделкаКонтролируетсяПоИнвестиционномуВычету,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоДополнительномуДоходуОтСырья КАК СделкаКонтролируетсяПоДополнительномуДоходуОтСырья,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодУсловийПоставки, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодУсловийПоставки,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СпособОпределенияЦеныСделки, ЗНАЧЕНИЕ(Справочник.СпособыОпределенияЦенКонтролируемыхСделок.ПустаяСсылка)) КАК СпособОпределенияЦеныСделки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|						ТОГДА ""019""
	|					ИНАЧЕ ""015""
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """")
	|	КОНЕЦ КАК КодНаименованияСделки,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ КАК СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу КАК СтороныВзаимозависимыПоКодексу,
	|	КонтролируемыеСделки.СделкаНеЯвляетсяКонтролируемойПоП4 КАК СделкаНеЯвляетсяКонтролируемойПоП4,
	|	КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник) КАК НеВзаимозависимыйПосредник,
	|	ВЫБОР
	|		КОГДА НЕ КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|				И (НЕ КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоМорскомуМесторождению.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОсвобождениюНДС.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоИнвестиционномуВычету.ГоловнойКонтрагент ЕСТЬ NULL)
	|				И НЕ КонтролируемыеСделки.СделкаНеЯвляетсяКонтролируемойПоП4
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаПопалаВУведомление,
	|	НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL КАК СуммаДоходовПоСделкеПревышаетОбщийПредел
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОбщейСумме КАК КонтрагентыКонтролируемыеПоОбщейСумме
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоНДПИ КАК КонтрагентыКонтролируемыеПоНДПИ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоСпецРежиму КАК КонтрагентыКонтролируемыеПоСпецРежиму
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоПрибыли КАК КонтрагентыКонтролируемыеПоПрибыли
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОЭЗ КАК КонтрагентыКонтролируемыеПоОЭЗ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоМорскомуМесторождению КАК КонтрагентыКонтролируемыеПоМорскомуМесторождению
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоМорскомуМесторождению.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаМорскогоМесторождения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам КАК КонтрагентыКонтролируемыеПоИнвестиционнымПроектам
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоИнвестиционнымПроектам.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОсвобождениюНДС КАК КонтрагентыКонтролируемыеПоОсвобождениюНДС
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОсвобождениюНДС.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоИнвестиционномуВычету КАК КонтрагентыКонтролируемыеПоИнвестиционномуВычету
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоИнвестиционномуВычету.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ КАК КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|				ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица КАК КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица.ГоловнойКонтрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО КонтролируемыеСделки.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И КонтролируемыеСделки.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И КонтролируемыеСделки.Договор = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыПоМинимальнойСумме КАК КонтрагентыПоМинимальнойСумме
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	КонтролируемыеСделки.Контрагент,
	|	КонтролируемыеСделки.Договор,
	|	КонтролируемыеСделки.ПредметСделки,
	|	КонтролируемыеСделки.Организация,
	|	КонтролируемыеСделки.ОтчетныйГод,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРазнымСтавкамНалогаНаПрибыль,
	|	КонтролируемыеСделки.ТипВзаимозависимости,
	|	КонтролируемыеСделки.СделкаОблагаетсяЕНВД,
	|	КонтролируемыеСделки.СделкаСПлательщикомЕСХН,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ,
	|	КонтролируемыеСделки.СделкаМорскогоМесторождения,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоДополнительномуДоходуОтСырья,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодУсловийПоставки, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СпособОпределенияЦеныСделки, ЗНАЧЕНИЕ(Справочник.СпособыОпределенияЦенКонтролируемыхСделок.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|						ТОГДА ""019""
	|					ИНАЧЕ ""015""
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """")
	|	КОНЕЦ,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу,
	|	КонтролируемыеСделки.СделкаНеЯвляетсяКонтролируемойПоП4,
	|	КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник),
	|	НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL,
	|	ВЫБОР
	|		КОГДА НЕ КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|				И (НЕ КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоМорскомуМесторождению.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоОсвобождениюНДС.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL
	|					ИЛИ НЕ КонтрагентыКонтролируемыеПоИнвестиционномуВычету.ГоловнойКонтрагент ЕСТЬ NULL)
	|				И НЕ КонтролируемыеСделки.СделкаНеЯвляетсяКонтролируемойПоП4
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаКонтролируемыхСделок2019()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КонтролируемыеСделки.Организация КАК Организация,
	|	КонтролируемыеСделки.ОтчетныйГод КАК ОтчетныйГод,
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК Контрагент,
	|	КонтролируемыеСделки.Контрагент КАК ОбособленноеПодразделениеКонтрагента,
	|	КонтролируемыеСделки.Договор КАК Договор,
	|	КонтролируемыеСделки.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли КАК СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ КАК КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	КонтролируемыеСделки.СделкаОблагаетсяЕНВД КАК СделкаОблагаетсяЕНВД,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРазнымСтавкамНалогаНаПрибыль КАК СделкаКонтролируетсяПоРазнымСтавкамНалогаНаПрибыль,
	|	КонтролируемыеСделки.СделкаСПлательщикомЕСХН КАК СделкаСПлательщикомЕСХН,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль КАК СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ КАК СделкаКонтролируетсяПоНДПИ,
	|	КонтролируемыеСделки.СделкаМорскогоМесторождения КАК СделкаМорскогоМесторождения,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам КАК СделкаКонтролируетсяПоИнвестиционнымПроектам,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС КАК СделкаКонтролируетсяПоОсвобождениюНДС,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету КАК СделкаКонтролируетсяПоИнвестиционномуВычету,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоДополнительномуДоходуОтСырья КАК СделкаКонтролируетсяПоДополнительномуДоходуОтСырья,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодУсловийПоставки, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодУсловийПоставки,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СпособОпределенияЦеныСделки, ЗНАЧЕНИЕ(Справочник.СпособыОпределенияЦенКонтролируемыхСделок.ПустаяСсылка)) КАК СпособОпределенияЦеныСделки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|						ТОГДА ""019""
	|					ИНАЧЕ ""015""
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """")
	|	КОНЕЦ КАК КодНаименованияСделки,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ КАК СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу КАК СтороныВзаимозависимыПоКодексу,
	|	КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник) КАК НеВзаимозависимыйПосредник,
	|	КонтролируемыеСделки.СделкаНеЯвляетсяКонтролируемойПоП4 КАК СделкаНеЯвляетсяКонтролируемойПоП4,
	|	НЕ КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|		И (НЕ КонтрагентыРФКонтролируемыеПоУсловию.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL)
	|		И НЕ КонтролируемыеСделки.СделкаНеЯвляетсяКонтролируемойПоП4 КАК СделкаПопалаВУведомление,
	|	НЕ КонтрагентыРФКонтролируемыеПоУсловию.ГоловнойКонтрагент ЕСТЬ NULL КАК СуммаДоходовПоСделкеПревышаетОбщийПредел
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыРФКонтролируемыеПоУсловию КАК КонтрагентыРФКонтролируемыеПоУсловию
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыРФКонтролируемыеПоУсловию.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоРазнымСтавкамНалогаНаПрибыль
	|				ИЛИ КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ
	|				ИЛИ КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН
	|				ИЛИ КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль
	|				ИЛИ КонтролируемыеСделки.СделкаМорскогоМесторождения
	|				ИЛИ КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС
	|				ИЛИ КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету
	|				ИЛИ КонтролируемыеСделки.СделкаКонтролируетсяПоДополнительномуДоходуОтСырья)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ КАК КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|				ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица КАК КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица.ГоловнойКонтрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО КонтролируемыеСделки.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И КонтролируемыеСделки.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И КонтролируемыеСделки.Договор = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыПоМинимальнойСумме КАК КонтрагентыПоМинимальнойСумме
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	КонтролируемыеСделки.Контрагент,
	|	КонтролируемыеСделки.Договор,
	|	КонтролируемыеСделки.ПредметСделки,
	|	КонтролируемыеСделки.Организация,
	|	КонтролируемыеСделки.ОтчетныйГод,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.ТипВзаимозависимости,
	|	КонтролируемыеСделки.СделкаОблагаетсяЕНВД,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРазнымСтавкамНалогаНаПрибыль,
	|	КонтролируемыеСделки.СделкаСПлательщикомЕСХН,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ,
	|	КонтролируемыеСделки.СделкаМорскогоМесторождения,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоДополнительномуДоходуОтСырья,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодУсловийПоставки, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СпособОпределенияЦеныСделки, ЗНАЧЕНИЕ(Справочник.СпособыОпределенияЦенКонтролируемыхСделок.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|						ТОГДА ""019""
	|					ИНАЧЕ ""015""
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """")
	|	КОНЕЦ,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу,
	|	КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник),
	|	КонтролируемыеСделки.СделкаНеЯвляетсяКонтролируемойПоП4,
	|	НЕ КонтрагентыРФКонтролируемыеПоУсловию.ГоловнойКонтрагент ЕСТЬ NULL,
	|	НЕ КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|		И (НЕ КонтрагентыРФКонтролируемыеПоУсловию.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеКакПрочиеЗависимыеЛица.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL)
	|		И НЕ КонтролируемыеСделки.СделкаНеЯвляетсяКонтролируемойПоП4";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДополнитьТаблицуПричинамиВключенияВУведомление(СделкиУведомления, ВерсияУведомления)
	
	СделкиУведомления.Колонки.Добавить("ПричинаПопаданияВКонтролируемыеСделки", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	СделкиУведомления.Колонки.Добавить("ПричинаВключения", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	
	Для Каждого Сделка Из СделкиУведомления Цикл
		
		Если ВерсияУведомления >= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2019() Тогда
			ЗаполнитьПричинуВключения2019(Сделка);
		Иначе
			ЗаполнитьПричинуВключения2012(Сделка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПричинуВключения2012(Сделка)
	
	Если Сделка.СделкаНеЯвляетсяКонтролируемойПоП4 Тогда
		Сделка.ПричинаПопаданияВКонтролируемыеСделки = "0";
		Сделка.ПричинаВключения = НСтр("ru = 'Сделка не является контролируемой по п. 4 ст. 105.14 НК РФ'");
		Возврат;
	КонецЕсли;
	
	ПричинаПопаданияВКонтролируемыеСделки = "";
	ПричиныВключенияВУведомление = Новый Массив;
	
	Если Сделка.СуммаДоходовПоСделкеПревышаетОбщийПредел Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "2";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'На общих основаниях (пп. 1 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоНДПИ Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "3";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку уплаты НДПИ (пп. 2 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаОблагаетсяЕНВД Или Сделка.СделкаСПлательщикомЕСХН Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "4";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку применения спец. режимов (пп. 3 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоНалогуНаПрибыль Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "5";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку уплаты налога на прибыль (пп. 4 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоРегистрацииВОЭЗ Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "6";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку особой экономической зоны (пп. 5 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаМорскогоМесторождения Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "7";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку морского месторождения (пп. 6 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоИнвестиционнымПроектам Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "8";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку регионального инвестиционного проекта (пп. 7 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоОсвобождениюНДС Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "9";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку освобождения от НДС (пп. 8 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоИнвестиционномуВычету Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "10";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку применения инвестиционного вычета (пп. 9 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "11";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Торговля товарами мировой биржевой торговли'"));
	КонецЕсли;
	
	Если Сделка.ЗарегистрированВСтранеСЛьготнымНалогообложением Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "12";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Сделка с офшором'"));
	КонецЕсли;
	
	Если Сделка.СтороныВзаимозависимыПоКодексу И Сделка.КонтрагентЗарегистрированВРФ Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "13";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Сделки с российскими взаимозависимыми лицами'"));
	КонецЕсли;
	
	Если Сделка.ТипВзаимозависимости = Перечисления.ТипыВзаимозависимости.НеВзаимозависимыйПосредник Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "14";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Не взаимозависимый посредник'"));
	КонецЕсли;
	
	Если Сделка.СтороныВзаимозависимыПоКодексу И Не Сделка.КонтрагентЗарегистрированВРФ Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "15";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Сделка с иностранным взаимозависимым лицом'"));
	КонецЕсли;
	
	Если ПричиныВключенияВУведомление.Количество() > 1 Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "1";
	КонецЕсли;
	
	Сделка.ПричинаПопаданияВКонтролируемыеСделки = ПричинаПопаданияВКонтролируемыеСделки;
	Сделка.ПричинаВключения = СтрСоединить(ПричиныВключенияВУведомление, "," + " ");
	
КонецПроцедуры

Процедура ЗаполнитьПричинуВключения2019(Сделка)
	
	Если Сделка.СделкаНеЯвляетсяКонтролируемойПоП4 Тогда
		Сделка.ПричинаПопаданияВКонтролируемыеСделки = "0";
		Сделка.ПричинаВключения = НСтр("ru = 'Сделка не является контролируемой по п. 4 ст. 105.14 НК РФ'");
		Возврат;
	КонецЕсли;
	
	ПричинаПопаданияВКонтролируемыеСделки = "";
	ПричиныВключенияВУведомление = Новый Массив;
	
	Если Сделка.СделкаКонтролируетсяПоРазнымСтавкамНалогаНаПрибыль Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "2";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку разных ставок налога на прибыль (пп. 1 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоНДПИ Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "3";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку уплаты НДПИ (пп. 2 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаОблагаетсяЕНВД Или Сделка.СделкаСПлательщикомЕСХН Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "4";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку применения спец. режимов (пп.3 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоНалогуНаПрибыль Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "5";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку уплаты налога на прибыль (пп. 4 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаМорскогоМесторождения Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "6";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку морского месторождения (пп. 6 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоОсвобождениюНДС Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "7";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку освобождения от НДС (пп. 8 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоИнвестиционномуВычету Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "9";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку применения инвестиционного вычета (пп. 9 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаКонтролируетсяПоДополнительномуДоходуОтСырья Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "10";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'По признаку плательщика налога на доп.доход от добычи углеводородного сырья (пп. 10 п. 2 ст. 105.14 НК РФ)'"));
	КонецЕсли;
	
	Если Сделка.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "11";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Торговля товарами мировой биржевой торговли'"));
	КонецЕсли;
	
	Если Сделка.ЗарегистрированВСтранеСЛьготнымНалогообложением Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "12";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Сделка с офшором'"));
	КонецЕсли;
	
	Если Сделка.ТипВзаимозависимости = Перечисления.ТипыВзаимозависимости.НеВзаимозависимыйПосредник Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "13";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Не взаимозависимый посредник'"));
	КонецЕсли;
	
	Если Сделка.СтороныВзаимозависимыПоКодексу И Не Сделка.КонтрагентЗарегистрированВРФ Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "14";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Сделка с иностранным взаимозависимым лицом'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПричинаПопаданияВКонтролируемыеСделки)
		И Сделка.СтороныВзаимозависимыПоКодексу И Сделка.КонтрагентЗарегистрированВРФ Тогда
		// Взаимозависимые лица теперь не включаются в уведомление без особых причин.
		// Поэтому, если нет причин для включения, то запишем в причины попадания, что это взаимозависимое лицо.
		// Это нужно, чтобы не было пустых группировок - иначе отчет выглядит некрасиво.
		ПричинаПопаданияВКонтролируемыеСделки = "15";
		ПричиныВключенияВУведомление.Добавить(НСтр("ru = 'Сделки с российскими взаимозависимыми лицами'"));
	КонецЕсли;
	
	Если ПричиныВключенияВУведомление.Количество() > 1 Тогда
		ПричинаПопаданияВКонтролируемыеСделки = "1";
	КонецЕсли;
	
	Сделка.ПричинаПопаданияВКонтролируемыеСделки = ПричинаПопаданияВКонтролируемыеСделки;
	Сделка.ПричинаВключения = СтрСоединить(ПричиныВключенияВУведомление, "," + " ");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
